app/Controllers/BlogController.php

SELECT *
FROM `blog`
---
    public function index()
    {
        $data['blogs'] = $this->blog->findAll();

SELECT *
FROM `blog`
WHERE `blog`.`id` = '1'
---
    public function edit($b_id)
    {
        $data = $this->blog->find($b_id);

UPDATE `blog` SET `title` = 'Tours & Travel', `details` = 'Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..Dolor justo sea kasd lorem clita justo diam amet..'
WHERE `blog`.`id` IN ('1')
---
    public function update($b_id)
    {
        $data = [
            'title' => $this->request->getVar('title'),
            'details' => $this->request->getVar('details'),
            // 'img' => $this->request->getVar('img'),
        ];

        $this->blog->update($b_id, $data);