app/Controllers/GuideController.php

    public function index()
    {
        $data['instructor'] = $this->instructor->findAll();
---
SELECT *
FROM `instructor`