app/Controllers/PackageController.php

SELECT *
FROM `packages`
---
    public function index(){
        $data['packages'] = $this->packages->findAll();

DELETE FROM `packages`
WHERE `id` = '12'
---
    public function delete($p_id)
    {
        $this->packages->where('id', $p_id);
        $this->packages->delete();