app/Controllers/ServiceController.php

    public function index()
    {


        $data['services'] = $this->services->findAll();
---
SELECT *
FROM `services`