app/Controllers/TestimonialController.php

SELECT *
FROM `testimonial`
---
    public function index()
    {
        $data['testimonials']=$this->testimonials->findAll();

DELETE FROM `testimonial`
WHERE `id` = '12'
---
    public function delete($t_id)
    {
        $this->testimonials->where('id', $t_id);
        $this->testimonials->delete();